---
type: SelectableInViewFilter
namespace: Autodesk.Revit.UI.Selection
version: 2024
members: 2
tags: [revit-api, class]
---

# SelectableInViewFilter

`Autodesk.Revit.UI.Selection.SelectableInViewFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SelectableInViewFilter | — | `` |
| Method | PassesFilter | — | `` |